In [1]:
import pandas as pd

C:\Users\Krish\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\Krish\anaconda3\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
C:\Users\Krish\anaconda3\lib\site-packages\numpy\.libs\libopenblas.XWYDX2IKJW2NMTWSFYNGFUWKQU3LYTCZ.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:\n%s" %

In [39]:
a = [['a',11,1000],['b',22,1200],['c',32,1300],['c',44,1300],['c',55,1300],['c',66,1300],['c',77,1300]]

#create data frame using list
df1 = pd.DataFrame(a, columns = ['M','N','K'])

In [40]:
df1

   M   N     K
0  a  11  1000
1  b  22  1200
2  c  32  1300
3  c  44  1300
4  c  55  1300
5  c  66  1300
6  c  77  1300

In [41]:
def convert(beta):
    a = 1
    if beta<55:
        a = 0
    return a

In [42]:
df1['N'] = df1['N'].apply(convert)

In [43]:
df1

   M  N     K
0  a  0  1000
1  b  0  1200
2  c  0  1300
3  c  0  1300
4  c  1  1300
5  c  1  1300
6  c  1  1300

In [16]:
df1.loc[df1['N']<50, 'N']=0

In [17]:
df1

   M   N     K
0  a   0  1000
1  b   0  1200
2  c   0  1300
3  c   0  1300
4  c  55  1300
5  c  66  1300
6  c  77  1300

In [ ]:
df.loc[df['c1'] == 'Value', 'c2'] = 10

In [14]:
df1['N'][df1['N']<50]=0

<ipython-input-14-4d30e0e09438>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['N'][df1['N']<50]=0

In [10]:
df1['N'][df1['N']>50]

Series([], Name: N, dtype: int64)

In [9]:
df1

   M  N     K
0  a  0  1000
1  b  0  1200
2  c  0  1300
3  c  0  1300
4  c  1  1300
5  c  1  1300
6  c  1  1300